In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
np.random.seed(12345)
np.set_printoptions(precision=4, suppress=True)

import matplotlib
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))

In [2]:
# matplotlib 한글 문제 해결 코드
%matplotlib inline
from matplotlib import font_manager, rc
import platform

if platform.system() == 'Windows':
    font_name = font_manager.FontProperties(fname="C:/Windows/Fonts/malgun.ttf").get_name()
    rc('font', family = font_name)
    
else:
    rc('font', family = "AppleGothic")
    
matplotlib.rcParams['axes.unicode_minus'] = False

In [1]:
#linux cat ex1.csv 
# !type : 도스 명령임
!type examples/ex1.csv # 파일 보는 법!

명령 구문이 올바르지 않습니다.

In [4]:
!pip install tqdm

Requirement already satisfied: tqdm in c:\users\playdata\appdata\local\conda\conda\envs\py36\lib\site-packages (4.26.0)

In [5]:
from tqdm import trange

In [6]:
import time

In [7]:
for i in trange(100):
    time.sleep(0.1)

100%|████████████████████████████████████████████████████████████████████████████████| 100/100 [00:10<00:00,  9.63it/s]

In [8]:
for i in range(100):
    time.sleep(0.1)

In [10]:
df = pd.read_csv('examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
pd.read_table('examples/ex1.csv', sep=',') # separator 설정해야 해!

In [12]:
df = pd.read_csv('examples/ex2.csv', header = None)
df

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [13]:
df = pd.read_csv("examples/ex2.csv", header = None, names = ['a', 'b', 'c','d', 'message'])
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
result = pd.read_table('examples/ex3.txt')
result

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [18]:
result = pd.read_table('examples/ex3.txt', sep='\s+') # s : 공백, + : 여러 번 나올 수 있다!
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [19]:
!type examples\\ex4.csv #  #으로 시작하는 행은 안 받아올거야!

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [20]:
pd.read_csv("examples/ex4.csv", skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [21]:
!type examples\\ex5.csv # NA 값 존재

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [22]:
result = pd.read_csv('examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [26]:
# 행이 10001개 ... 좀 많을 때 불러오는 행 갯수 제한 가능!
result = pd.read_csv("examples/ex6.csv", nrows=5)
result

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [32]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=10000)
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending =False)
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [34]:
data = pd.read_csv("examples/ex5.csv")
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [35]:
data.to_csv('examples/out.csv')

## JSON 처리

In [46]:
obj = """
{"name": "Wes",
"place_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age":25, "pet": "Zuko"},
             {"name": "Katie", "age":33, "pet": "Cisco"}]
}
"""

In [47]:
import json

In [50]:
result = json.loads(obj)
result

{'name': 'Wes',
 'place_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 25, 'pet': 'Zuko'},
  {'name': 'Katie', 'age': 33, 'pet': 'Cisco'}]}

In [51]:
type(result)

dict

In [52]:
asjson = json.dumps(result) # dict -> 문자열로!
asjson

'{"name": "Wes", "place_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 25, "pet": "Zuko"}, {"name": "Katie", "age": 33, "pet": "Cisco"}]}'

In [55]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   25
1  Katie   33

## 이진 데이터 저장!

In [57]:
frame = pd.read_csv("examples/ex1.csv")
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [58]:
frame.to_pickle('examples/frame_pickle')

In [59]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [60]:
# hdf5 압축률 좋은 저장 형식!
store = pd.HDFStore('mydata.h5')

In [62]:
store['obj1'] = frame

In [64]:
store['obj1_col'] = frame['a']

In [66]:
store # 후에 머신러닝에서 결과를 h5 형태로 저장함!

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [67]:
store['obj1']

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [68]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [71]:
pd.read_excel(xlsx, 'Sheet1') # 굳이 이렇게 안해도 됨!

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [73]:
df = pd.read_excel('examples/ex1.xlsx')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo